In [60]:
import numpy as np 
import pandas as pd 
import matplotlib as plt

In [61]:
gender = pd.read_csv("titanic/gender_submission.csv")
test = pd.read_csv("titanic/test.csv")
train = pd.read_csv("titanic/train.csv")

In [62]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [63]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [64]:
gender

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

# Selecting Rows With .iloc

In [65]:
gender.iloc[1]

PassengerId    893
Survived         1
Name: 1, dtype: int64

#### Printing more than one row

In [66]:
gender.iloc[[0, 1, -1]]
# the 2 brackets are due to the fact that when 
# we call more than one row, we pass a list to the program

     PassengerId  Survived
0            892         0
1            893         1
417         1309         0

#### Printing a range of rows

In [67]:
gender.iloc[1:5]
# note that the row 5 is not inlcuded

   PassengerId  Survived
1          893         1
2          894         0
3          895         0
4          896         1

In [68]:
# calling the first 5 rows
gender.iloc[:5]

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

In [69]:
# calling the last 5 rows
gender.iloc[-5:]

     PassengerId  Survived
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

In [70]:
# calling all rows
gender.iloc[:]

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

#### Printing row 4, column 3 value:

In [71]:
test.iloc[4, 3]

'female'

#### Printing row first 5 rows, and its columns 0, 2, 4 and 8

In [72]:
test.iloc[:5, [0, 2, 4, 8]]

   PassengerId                                          Name   Age     Fare
0          892                              Kelly, Mr. James  34.5   7.8292
1          893              Wilkes, Mrs. James (Ellen Needs)  47.0   7.0000
2          894                     Myles, Mr. Thomas Francis  62.0   9.6875
3          895                              Wirz, Mr. Albert  27.0   8.6625
4          896  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  22.0  12.2875

#### Testing to see if it matches with the column

In [73]:
test.iloc[:, 0].equals(test.PassengerId)

True

# Selecting Rows With .loc

In [74]:
test.loc[1]
# loc can select more rows. If there were several "1" rows, 
# all of them would appear here

PassengerId                                 893
Pclass                                        3
Name           Wilkes, Mrs. James (Ellen Needs)
Sex                                      female
Age                                        47.0
SibSp                                         1
Parch                                         0
Ticket                                   363272
Fare                                        7.0
Cabin                                       NaN
Embarked                                      S
Name: 1, dtype: object

In [78]:
test.loc[2, "Pclass"]
# remember that 2 here is not the index, but the name of the row!

2

#### Calling 2 or more Rows Using .loc

In [80]:
test.loc[[2, 4],["Pclass"]]

   Pclass
2       2
4       3

In [84]:
# if these values do not repeat, we can call them like this:
test.loc[2:4,"Pclass":"Parch"]

,Pclass,Name,Sex,Age,SibSp,Parch
2,2,"Myles, Mr. Thomas Francis",male,62.0,0,0
3,3,"Wirz, Mr. Albert",male,27.0,0,0
4,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1

In [86]:
name = test["Name"]

In [87]:
name.dtype

dtype('O')

In [89]:
name.shape

(418,)

In [90]:
len(name)

418

In [91]:
name.index

RangeIndex(start=0, stop=418, step=1)

In [93]:
name.to_frame()

                                             Name
0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
..                                            ...
413                            Spector, Mr. Woolf
414                  Oliva y Ocana, Dona. Fermina
415                  Saether, Mr. Simon Sivertsen
416                           Ware, Mr. Frederick
417                      Peter, Master. Michael J

[418 rows x 1 columns]

In [94]:
name.to_frame().info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    418 non-null    object
dtypes: object(1)
memory usage: 3.4+ KB

Above, we se the infos about the dataframe created by to_frame(). Remember that .info() only works with dataframes, not with columns.

# Analyzing Numerical Series

In [101]:
age = test["Age"]

In [102]:
age.describe()

count    332.000000
mean      30.272590
std       14.181209
min        0.170000
25%       21.000000
50%       27.000000
75%       39.000000
max       76.000000
Name: Age, dtype: float64

In [103]:
age.count()

332

In [104]:
age.size

418

In [110]:
age.sum()

10050.5

In [111]:
sum(age)

nan

In [112]:
# nan above happens, because the Python function doesn't know
# what to do with missing values!

In [113]:
# we can also check this with se sum method, setting skipna to False
age.sum(skipna = False)

nan

In [107]:
age.mean()

30.272590361445783

In [108]:
age.median()

27.0

In [114]:
age.std()

14.18120923562442

In [115]:
age.min()

0.17

In [116]:
age.max()

76.0

In [120]:
age.unique()

array([34.5 , 47.  , 62.  , 27.  , 22.  , 14.  , 30.  , 26.  , 18.  ,
       21.  ,   nan, 46.  , 23.  , 63.  , 24.  , 35.  , 45.  , 55.  ,
        9.  , 48.  , 50.  , 22.5 , 41.  , 33.  , 18.5 , 25.  , 39.  ,
       60.  , 36.  , 20.  , 28.  , 10.  , 17.  , 32.  , 13.  , 31.  ,
       29.  , 28.5 , 32.5 ,  6.  , 67.  , 49.  ,  2.  , 76.  , 43.  ,
       16.  ,  1.  , 12.  , 42.  , 53.  , 26.5 , 40.  , 61.  , 60.5 ,
        7.  , 15.  , 54.  , 64.  , 37.  , 34.  , 11.5 ,  8.  ,  0.33,
       38.  , 57.  , 40.5 ,  0.92, 19.  , 36.5 ,  0.75,  0.83, 58.  ,
        0.17, 59.  , 14.5 , 44.  ,  5.  , 51.  ,  3.  , 38.5 ])

In [121]:
# the unique method includes the missing values:
len(age.unique())

80

In [118]:
# nunique also returns the unique values, but by default excludes the missing ones
age.nunique()

79

In [122]:
# we can make it count the missing values, setting this to False:
age.nunique(dropna = False)

80

In [125]:
# most to least frequent unique values
age.value_counts()

Age
21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
76.0     1
28.5     1
22.5     1
62.0     1
38.5     1
Name: count, Length: 79, dtype: int64

In [127]:
# sort according to order of appearance 
age.value_counts(sort = False, dropna = True)

Age
34.5     1
47.0     5
62.0     1
27.0    12
22.0    16
        ..
44.0     1
5.0      1
51.0     1
3.0      1
38.5     1
Name: count, Length: 79, dtype: int64

In [129]:
age.value_counts(ascending = False)

Age
21.0    17
24.0    17
22.0    16
30.0    15
18.0    13
        ..
76.0     1
28.5     1
22.5     1
62.0     1
38.5     1
Name: count, Length: 79, dtype: int64

In [132]:
# by default, the frequencies are absolute, but we can change it to relative
# with normalize
age.value_counts(sort = True, ascending = False, normalize = True)

Age
21.0    0.051205
24.0    0.051205
22.0    0.048193
30.0    0.045181
18.0    0.039157
          ...
76.0    0.003012
28.5    0.003012
22.5    0.003012
62.0    0.003012
38.5    0.003012
Name: proportion, Length: 79, dtype: float64

In [131]:
age.value_counts().sum()

332

In [137]:
# if we concatenate the relative values, we get 1
age.value_counts(sort = True, ascending = False, normalize = True).sum()

1.0000000000000002

In [139]:
age.size

418

In [141]:
# creating equal values intervals
age.value_counts(sort = True, ascending = False, normalize = False, bins = 5)

(15.336, 30.502]    168
(30.502, 45.668]     80
(45.668, 60.834]     42
(0.0932, 15.336]     32
(60.834, 76.0]       10
Name: count, dtype: int64

# Analyzing Non-Numerical Series

In [144]:
name = test["Name"]

In [145]:
name.head()

0                                Kelly, Mr. James
1                Wilkes, Mrs. James (Ellen Needs)
2                       Myles, Mr. Thomas Francis
3                                Wirz, Mr. Albert
4    Hirvonen, Mrs. Alexander (Helga E Lindqvist)
Name: Name, dtype: object

In [146]:
name.tail()

413              Spector, Mr. Woolf
414    Oliva y Ocana, Dona. Fermina
415    Saether, Mr. Simon Sivertsen
416             Ware, Mr. Frederick
417        Peter, Master. Michael J
Name: Name, dtype: object

In [147]:
name.dtype

dtype('O')

In [148]:
name.shape

(418,)

In [149]:
name.describe()

count                  418
unique                 418
top       Kelly, Mr. James
freq                     1
Name: Name, dtype: object

In [150]:
name.size

418

In [153]:
# if there were null values, count would return a smaller number than .size.
name.count()

418

In [158]:
name.min()
# alphabetically, we get the first value

'Abbott, Master. Eugene Joseph'

In [155]:
len(name.unique())

418

In [156]:
name.nunique()

418

In [157]:
name.value_counts()

Name
Kelly, Mr. James               1
Carr, Miss. Jeannie            1
Dennis, Mr. William            1
Rosblom, Miss. Salli Helena    1
Touma, Miss. Maria Youssef     1
                              ..
Zakarian, Mr. Mapriededer      1
Carlsson, Mr. Carl Robert      1
Dintcheff, Mr. Valtcho         1
Thomas, Mr. Charles P          1
Peter, Master. Michael J       1
Name: count, Length: 418, dtype: int64

# Changing Column Names

In [159]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C